# Remove Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTable..::..Remove Method
ExportLineweightTable Class See Also
---
Removes the pair (key, info) corresponding to the given ExportLineweightKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Remove(
	ExportLineweightKey exportLineweightKey
)
```

Visual Basic
---
```text
Public Sub Remove ( _
	exportLineweightKey As ExportLineweightKey _
)
```

Visual C++
---
```text
public:
void Remove(
	ExportLineweightKey^ exportLineweightKey
)
```

# ### Parameters
exportLineweightKey
    Type: Autodesk.Revit.DB..::..ExportLineweightKey The export line weight key
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace